Revit 2026 API

# DisciplineTypeId Class

---

This class contains constants identifying disciplines.

SystemObject Autodesk.Revit.DBDisciplineTypeId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DisciplineTypeId
```
```vb
Public NotInheritable Class DisciplineTypeId
```
```cpp
public ref class DisciplineTypeId abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DisciplineTypeId = class end
```

The DisciplineTypeId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Architecture | Architecture. |
|  | Common | Common. |
|  | Electrical | Electrical. |
|  | Energy | Energy. |
|  | Hvac | HVAC. |
|  | Infrastructure | Infrastructure. |
|  | Piping | Piping. |
|  | Structural | Structural. |

#### Reference

Autodesk.Revit.DB Namespace